# DoubleClickOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleClickOptions Methods
DoubleClickOptions Class See Also
---
The DoubleClickOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAction | Returns the active user's desired action for a particular double-click target. |
| GetDoubleClickOptions | Returns the current user's DoubleClickOptions. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRenameOnSlowDoubleClickInProjectBrowser | Returns the user's desire to rename item in project browser on slow double-click. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsSupportedAction | Checks whether the specified double-click target supports the specified action. |
| SetAction | Changes the double-click action associated with a specified target. |
| SetRenameOnSlowDoubleClickInProjectBrowser | Sets whether the desired action is to rename item in project browser on slow double-click. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace